{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.6", "config": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 32, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "batch_input_shape": [null, 72, 72, 3], "dtype": "float32", "trainable": true, "bias_constraint": null, "padding": "valid", "kernel_size": [3, 3], "bias_regularizer": null, "strides": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 32, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "bias_constraint": null, "padding": "valid", "kernel_size": [3, 3], "bias_regularizer": null, "strides": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 64, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "bias_constraint": null, "padding": "valid", "kernel_size": [3, 3], "bias_regularizer": null, "strides": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_3", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 128, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "bias_constraint": null, "padding": "valid", "kernel_size": [3, 3], "bias_regularizer": null, "strides": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_4", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"units": 128, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "activation": "linear", "name": "dense_1", "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"units": 1, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "activation": "linear", "name": "dense_2", "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "sigmoid", "trainable": true}}]}